# pandas Reading csv files

In [6]:
import pandas as pd
df = pd.read_csv('data.csv')
print(df)

   ID     Name  Age   Department    JoinDate  Salary
0   1    Alice   28  Engineering  2020-01-15   70000
1   2      Bob   34    Marketing  2018-03-22   65000
2   3  Charlie   25        Sales  2021-07-01   50000
3   4    Diana   30  Engineering  2019-10-12   72000
4   5    Ethan   29           HR  2022-02-20   48000
5   6    Farah   26    Marketing  2023-05-05   51000
6   7   George   35        Sales  2017-08-10   68000
7   8     Huda   32           HR  2021-11-11   53000
8   9     Ivan   27  Engineering  2022-06-18   69000
9  10    Jenny   31    Marketing  2020-09-30   60000

In [11]:
df.head()

   ID     Name  Age   Department    JoinDate  Salary
0   1    Alice   28  Engineering  2020-01-15   70000
1   2      Bob   34    Marketing  2018-03-22   65000
2   3  Charlie   25        Sales  2021-07-01   50000
3   4    Diana   30  Engineering  2019-10-12   72000
4   5    Ethan   29           HR  2022-02-20   48000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   JoinDate    10 non-null     object
 5   Salary      10 non-null     int64
dtypes: int64(3), object(3)
memory usage: 612.0+ bytes

In [5]:
import pandas as pd

df = pd.read_csv(r"C:\Users\Pacific BD\OneDrive\Machine_learning\data.csv")
print(df.head())

   ID     Name  Age   Department    JoinDate  Salary
0   1    Alice   28  Engineering  2020-01-15   70000
1   2      Bob   34    Marketing  2018-03-22   65000
2   3  Charlie   25        Sales  2021-07-01   50000
3   4    Diana   30  Engineering  2019-10-12   72000
4   5    Ethan   29           HR  2022-02-20   48000

In [8]:


#get the unique category counts

df['ID'].value_counts()

ID
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
Name: count, dtype: int64

In [9]:
print(df.columns)

Index(['ID', 'Name', 'Age', 'Department', 'JoinDate', 'Salary'], dtype='object')

In [10]:
#Count how many employees in each department:

df['Department'].value_counts()

Department
Engineering    3
Marketing      3
Sales          2
HR             2
Name: count, dtype: int64

In [11]:
#Average age of employees:
df['Age'].mean()

29.7

In [12]:
#Highest salary:
df['Salary'].max()

72000

In [13]:
#Show rows where Salary > 60000:

df[df['Salary'] > 60000]

   ID    Name  Age   Department    JoinDate  Salary
0   1   Alice   28  Engineering  2020-01-15   70000
1   2     Bob   34    Marketing  2018-03-22   65000
3   4   Diana   30  Engineering  2019-10-12   72000
6   7  George   35        Sales  2017-08-10   68000
8   9    Ivan   27  Engineering  2022-06-18   69000

In [16]:
#computes the pairwise correlation between columns

corr_matrix = df.corr(numeric_only=True)
print(corr_matrix)

              ID       Age    Salary
ID      1.000000  0.137552 -0.110068
Age     0.137552  1.000000  0.352591
Salary -0.110068  0.352591  1.000000

In [19]:
#Average salary per department
avg_salary = df.groupby('Department')['Salary'].mean()
print(avg_salary)

Department
Engineering    70333.333333
HR             50500.000000
Marketing      58666.666667
Sales          59000.000000
Name: Salary, dtype: float64

In [21]:
#ডেটাফ্রেমে যত খালি বা NaN (Not a Number) আছে, সবকিছু 0 দিয়ে পূরণ করে।
df_filled = df.fillna(0)
print(df_filled)

   ID     Name  Age   Department    JoinDate  Salary
0   1    Alice   28  Engineering  2020-01-15   70000
1   2      Bob   34    Marketing  2018-03-22   65000
2   3  Charlie   25        Sales  2021-07-01   50000
3   4    Diana   30  Engineering  2019-10-12   72000
4   5    Ethan   29           HR  2022-02-20   48000
5   6    Farah   26    Marketing  2023-05-05   51000
6   7   George   35        Sales  2017-08-10   68000
7   8     Huda   32           HR  2021-11-11   53000
8   9     Ivan   27  Engineering  2022-06-18   69000
9  10    Jenny   31    Marketing  2020-09-30   60000

In [23]:
# যেসব সারিতে খালি মান আছে, সেগুলো ডেটাফ্রেম থেকে পুরোপুরি মুছে ফেলে।
df_dropped = df.dropna()
print(df_dropped)

   ID     Name  Age   Department    JoinDate  Salary
0   1    Alice   28  Engineering  2020-01-15   70000
1   2      Bob   34    Marketing  2018-03-22   65000
2   3  Charlie   25        Sales  2021-07-01   50000
3   4    Diana   30  Engineering  2019-10-12   72000
4   5    Ethan   29           HR  2022-02-20   48000
5   6    Farah   26    Marketing  2023-05-05   51000
6   7   George   35        Sales  2017-08-10   68000
7   8     Huda   32           HR  2021-11-11   53000
8   9     Ivan   27  Engineering  2022-06-18   69000
9  10    Jenny   31    Marketing  2020-09-30   60000

In [25]:
#astype() ফাংশন দিয়ে একটি কলামের ডেটা টাইপ পরিবর্তন করা যায়।
df['Age'] = df['Age'].astype(int)
print(df)

   ID     Name  Age   Department    JoinDate  Salary
0   1    Alice   28  Engineering  2020-01-15   70000
1   2      Bob   34    Marketing  2018-03-22   65000
2   3  Charlie   25        Sales  2021-07-01   50000
3   4    Diana   30  Engineering  2019-10-12   72000
4   5    Ethan   29           HR  2022-02-20   48000
5   6    Farah   26    Marketing  2023-05-05   51000
6   7   George   35        Sales  2017-08-10   68000
7   8     Huda   32           HR  2021-11-11   53000
8   9     Ivan   27  Engineering  2022-06-18   69000
9  10    Jenny   31    Marketing  2020-09-30   60000